InformationRegisters/ТоварныйАссортиментТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ТоварныйАссортиментТочек</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выведена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запрещена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>id_TT</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзПотерянных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестаХраненияВМагазинах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>МестаХраненияВМагазинах</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Хватает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоВыкладки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаВыкладки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВыкладкаПланограммы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ВыкладкаПланограммы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МестоВыкладки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаВыкладки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТоварВыведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Планограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Планограммы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/КатегорииАссортимента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>КатегорииАссортимента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обязательный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новинки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсобыеТовары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Необязательный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ТоварныйАссортиментТочек/Forms/ФормаЗаписи/Ext/Form/Module.bsl
Процедура УстановитьДоступностьЗапрещена()
	
	Элементы.Запрещена.Доступность = Запись.Выведена;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//mind
	Если ОткрытоИзМагазина Тогда
		
		Если ТекущийОбъект.Выведена
				И ТекущийОбъект.Номенклатура.КатегорияАссортимента = Перечисления.КатегорииАссортимента.Необязательный Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТоргТочка"	, ТекущийОбъект.ТорговаяТочка);
			Запрос.УстановитьПараметр("Номенклатура", ТекущийОбъект.Номенклатура);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ТоварныйАссортиментТочекСрезПоследних.Выведена
			|ИЗ
			|	РегистрСведений.ТоварныйАссортиментТочек.СрезПоследних(
			|			,
			|			ТорговаяТочка = &ТоргТочка
			|				И Номенклатура = &Номенклатура) КАК ТоварныйАссортиментТочекСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварныйАссортиментТочекСрезПоследних.ТорговаяТочка) КАК КолвоМагазинов,
			|	СУММА(ВЫБОР
			|			КОГДА ТоварныйАссортиментТочекСрезПоследних.Выведена
			|				ТОГДА 1
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК КолвоВыведенных
			|ИЗ
			|	РегистрСведений.ТоварныйАссортиментТочек.СрезПоследних(, Номенклатура = &Номенклатура) КАК ТоварныйАссортиментТочекСрезПоследних";
						   
			Результаты = Запрос.ВыполнитьПакет();
			Выборка = Результаты[0].Выбрать();
			Если Выборка.Следующий()
					И НЕ Выборка.Выведена Тогда
				ВыборкаМагазины = Результаты[1].Выбрать();
				Если ВыборкаМагазины.Следующий()
						И ТипЗнч(ВыборкаМагазины.КолвоМагазинов) = Тип("Число")
						И ВыборкаМагазины.КолвоМагазинов > 0 Тогда
					Если ВыборкаМагазины.КолвоВыведенных / ВыборкаМагазины.КолвоМагазинов >= 0.5 Тогда
						Сообщить("Этому товару назначена категория Необязательный. Он уже выведен более чем на 50 процентах магазинов. Для вывода его с вашего магазина обращайтесь к Татьяне Янышевой или в управление заказов.");
						Отказ = Истина;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		
		//АК БЕЛН 05.04.2017+
		Если ТекущийОбъект.Выведена
				И ТекущийОбъект.Номенклатура.КатегорияАссортимента = Перечисления.КатегорииАссортимента.Новинки Тогда

			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Магазин"		, ТекущийОбъект.ТорговаяТочка);
			Запрос.УстановитьПараметр("Номенклатура", ТекущийОбъект.Номенклатура);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	МестаХраненияВМагазинах.Магазин,
			|	МестаХраненияВМагазинах.МестоВыкладки,
			|	МестаХраненияВМагазинах.Хватает
			|ИЗ
			|	РегистрСведений.МестаХраненияВМагазинах КАК МестаХраненияВМагазинах
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ВыкладкаПланограммы.МестоВыкладки.Родитель КАК МестоВыкладки
			|		ИЗ
			|			РегистрСведений.ВыкладкаПланограммы КАК ВыкладкаПланограммы
			|		ГДЕ
			|			ВыкладкаПланограммы.Номенклатура = &Номенклатура
			|			И ВыкладкаПланограммы.Планограмма В
			|					(ВЫБРАТЬ
			|						СтруктурныеЕдиницы.Планограмма
			|					ИЗ
			|						Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
			|					ГДЕ
			|						СтруктурныеЕдиницы.Ссылка = &Магазин)) КАК ВЗ_Выкладка
			|		ПО МестаХраненияВМагазинах.МестоВыкладки = ВЗ_Выкладка.МестоВыкладки
			|ГДЕ
			|	МестаХраненияВМагазинах.Магазин = &Магазин
			|	И МестаХраненияВМагазинах.Хватает";
			Выборка = Запрос.Выполнить().Выбрать();

			Пока Выборка.Следующий() Цикл
				Сообщить("Новинку нельзя вывести");
				Отказ = Истина;
			КонецЦикла;
			
		КонецЕсли;
		//АК БЕЛН 05.04.2017-
		
	КонецЕсли;	
	
	//+++АК MIND 2017.12.17 есть магазины, в которых нельзя торговать алкоголем
	Если Запись.Выведена
		И Запись.Запрещена
		И Запись.ТорговаяТочка.НеТоргуетАлкольнойПродукцией
		И ЗначениеЗаполнено(Запись.Номенклатура.ВидПродукции) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В указанном магазине нельзя торговать алкогольной продукцией",,,, Отказ);
	КонецЕсли;
	//---АК MIND 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОткрытоИзМагазина = Параметры.ОткрытоИзМагазина;
	Если ОткрытоИзМагазина Тогда
		Попытка
			Запись.ТорговаяТочка = ПараметрыСеанса.ТорговаяТочкаПоАйпи;
			Элементы.ТорговаяТочка.Доступность = Ложь;
			Элементы.Номенклатура.ФормаВыбора = "Справочник.Номенклатура.Форма.ФормаВыбораДляМагазина.";
		Исключение
		КонецПопытки;	
	КонецЕсли;	
	УстановитьДоступностьЗапрещена();
	
	//Попытка
	//	Если ЗначениеЗаполнено(ПараметрыСеанса.ТорговаяТочкаПоАйпи) Тогда
	//		Элементы.ТорговаяТочка.Доступность = Ложь;
	//		Если НЕ ЗначениеЗаполнено(Запись.ТорговаяТочка) Тогда
	//			Запись.ТорговаяТочка = ПараметрыСеанса.ТорговаяТочкаПоАйпи;
	//		КонецЕсли;	
	//	КонецЕсли;	
	//Исключение		
	//КонецПопытки;		
	
КонецПроцедуры


&НаКлиенте
Процедура ВыведенаПриИзменении(Элемент)
	
	УстановитьДоступностьЗапрещена();
	
	Если Запись.Запрещена
			И НЕ Запись.Выведена Тогда
		Запись.Запрещена = Ложь;
	КонецЕсли;
	
КонецПроцедуры
